clojure-jack-in-troubles.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>clojure-jack-in-troubles</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="clojure-jack-in-troubles"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-03-18 14:53:45 CET"/>
<meta name="author" content="Antoine Romain Dumont"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">clojure-jack-in-troubles</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Versions</a>
<ul>
<li><a href="#sec-1-1">1.1 lein - 1.7.1-SNAPSHOT</a></li>
<li><a href="#sec-1-2">1.2 swank-clojure 1.4.0</a></li>
<li><a href="#sec-1-3">1.3 emacs</a></li>
<li><a href="#sec-1-4">1.4 emacs el:</a></li>
</ul>
</li>
<li><a href="#sec-2">2 Install emacs 24</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Versions</h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> lein - 1.7.1-SNAPSHOT</h3>
<div class="outline-text-3" id="text-1-1">




<pre class="example">tony@dagobah(0.18,) 12:12:56 ~/repositories/perso/test $ lein -v
Leiningen 1.7.1-SNAPSHOT on Java 1.6.0_26 Java HotSpot(TM) Client VM
</pre>

</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> swank-clojure 1.4.0</h3>
<div class="outline-text-3" id="text-1-2">




<pre class="example">tony@dagobah(0.08,) 14:36:49 ~/repositories/perso/test $ ls ~/.lein/plugins/
lein-cljs-0.2.2.jar  lein-marginalia-0.7.0-SNAPSHOT.jar  lein-midje-1.0.7.jar  lein-noir-1.2.1.jar  swank-clojure-1.4.0.jar
</pre>


</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> emacs</h3>
<div class="outline-text-3" id="text-1-3">




<pre class="example">tony@dagobah(0.07,) 14:36:53 ~/repositories/perso/test $ emacs -version
GNU Emacs 24.0.94.1
</pre>


</div>

</div>

<div id="outline-container-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> emacs el:</h3>
<div class="outline-text-3" id="text-1-4">




<pre class="example">clojure-mode       1.11.5       installed  Major mode for Clojure code
  find-file-in-pr... 3.0          installed  Find files in a project quickly.
  flymake-shell      0.5          installed  A flymake syntax-checker for shell scripts
  graphviz-dot-mode  0.3.7        installed  Mode for the dot-language used by graphviz (att).
  idle-highlight-... 1.1.2        installed  highlight the word the point is on
  ido-ubiquitous     1.0          installed  Use ido (nearly) everywhere.
  magit              1.1.1        installed  Control Git from Emacs.
  midje-mode         0.1.0        installed  Minor mode for running Midje tests in emacs, see: https://github.com/dnaumov/midje-mode
  multi-term         0.8.8        installed  Managing multiple terminal buffers in Emacs.
  paredit            22           installed  minor mode for editing parentheses  -*- Mode: Emacs-Lisp -*-
  slime              20100404.1   installed  Superior Lisp Interaction Mode for Emacs
  smex               1.1.2        installed  M-x interface with Ido-style fuzzy matching.
  starter-kit        2.0.3        installed  Saner defaults and goodies.
  starter-kit-bin... 2.0.2        installed  Saner defaults and goodies: bindings
  switch-window      0.9          installed  A *visual* way to choose a window to switch to
</pre>

</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Install emacs 24</h2>
<div class="outline-text-2" id="text-2">

<p>J'ai un equivalent de ton install-emacs24.sh
</p>


<pre class="example">~/bin/deploy-emacs24.sh
</pre>


<p>
qui fait dans les grandes lignes la meme chose que toi.
</p>
<p>
Un detail qui joue, j'ai decorelle l'install du setup, du coup pour refaire le setup:
</p>


<pre class="example">~/bin/setup-emacs24.sh
</pre>


<p>
Ensuite, je demarre emacs qui charge tout seul les dependances telles que declares dans <code>~/.emacs.d/init.el</code> genere par <code>setup-emacs24.sh</code>.
</p>
<p>
Qd je lance :
</p>


<pre class="example">emacs -fs -e clojure-jack-in -e split-window-vertically -e other-window -e multi-term
</pre>


<p>
J'ai l'erreur:
</p>


<pre class="example">Debugger entered--Lisp error: (error "Could not start swank server:
rlwrap: Oops, crashed (caught SIGFPE) - this should not have happened!
If you need a core dump, re-configure with --enable-debug and rebuild
Resetting terminal and cleaning up...
")
  signal(error ("Could not start swank server: \nrlwrap: Oops, crashed (caught SIGFPE) - this should not have happened!\nIf you need a core dump, re-configure with --enable-debug and rebuild\nResetting terminal and cleaning up...\n"))
  error("Could not start swank server: %s" "\nrlwrap: Oops, crashed (caught SIGFPE) - this should not have happened!\nIf you need a core dump, re-configure with --enable-debug and rebuild\nResetting terminal and cleaning up...\n")
  clojure-jack-in-sentinel(#&lt;process swank&gt; "exited abnormally with code 1\n")
</pre>


<p>
Qd je lance:
</p>


<pre class="example">lein swank
</pre>

<p>
Pas de pb.
Puis je lance un <code>M-x slime-connect</code>
Ca a l'air d'aller bien avec les petites phrases marrantes avant d'ouvrir un repl sauf que pas de repl.
Si j'ouvre le buffer swank, j'ai
</p>


<pre class="example">rlwrap: Oops, crashed (caught SIGFPE) - this should not have happened!
If you need a core dump, re-configure with --enable-debug and rebuild
Resetting terminal and cleaning up...
</pre>


<p>
Bref, un truc qui pue.
Je pense a une desynchro de version entre slime et swank.
</p>
<p>
Je n'ai pas essaye le &ndash;enable-debug parce que je ne sais pas de quoi il s'agit.
</p></div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-03-18 14:53:45 CET</p>
<p class="author">Author: Antoine Romain Dumont</p>
<p class="creator">Org version 7.8.03 with Emacs version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
